In [1]:
import pandas as pd
import os
import numpy as np

In [2]:
os.listdir('data')

['file_1.xlsx', 'file_2.csv', 'new_result.csv']

In [3]:
import xlrd
df1 = pd.read_excel('data/file_1.xlsx')
print (df1.shape)
df1.head()

(1189, 6)

            filename   a     b     c   d         e
0  Ajay Thakur0.jpeg  33  Male  1.85  76  22.20599
1  Ajay Thakur1.jpeg  33  Male  1.85  76  22.20599
2  Ajay Thakur2.jpeg  33  Male  1.85  76  22.20599
3  Ajay Thakur3.jpeg  33  Male  1.85  76  22.20599
4  Ajay Thakur4.jpeg  33  Male  1.85  76  22.20599

In [4]:
print (df1.columns.values)

['filename' 'a' 'b' 'c' 'd' 'e']

In [9]:
df2 = pd.read_csv('data/file_2.csv')
print (df2.shape)
df2.head()

(2334, 6)

  filename   a  b       c           d          e
0     401a  23  F  1.7272  122.469940  41.052938
1     403a  19  M  1.8034  112.944500  34.728095
2     403b  19  M  1.8034   93.893621  28.870344
3     404b  32  M  1.7272   93.440028  31.321871
4     405b  23  F  1.7272   93.440028  31.321871

Concatenating the dataframes

In [10]:
result = pd.concat([df1,df2])

In [11]:
result.shape

(3523, 6)

In [12]:
result.head()

            filename   a     b     c     d         e
0  Ajay Thakur0.jpeg  33  Male  1.85  76.0  22.20599
1  Ajay Thakur1.jpeg  33  Male  1.85  76.0  22.20599
2  Ajay Thakur2.jpeg  33  Male  1.85  76.0  22.20599
3  Ajay Thakur3.jpeg  33  Male  1.85  76.0  22.20599
4  Ajay Thakur4.jpeg  33  Male  1.85  76.0  22.20599

In [20]:
result.to_csv('data/final.csv')